In [2]:
import pandas as pd
import numpy as np

In [65]:
cars=pd.read_csv('Automobile_data.csv')
cars.head(10)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,n.a
5,5,audi,sedan,99.8,177.3,ohc,five,110,19,15250
6,6,audi,wagon,105.8,192.7,ohc,five,110,19,18920
7,9,bmw,sedan,101.2,176.8,ohc,four,101,23,16430
8,10,bmw,sedan,101.2,176.8,ohc,four,101,23,16925
9,11,bmw,sedan,101.2,176.8,ohc,six,121,21,n.a

# Cleaning of Data

In [66]:
#let's check for NAN values first
cars.isna().sum()

index               0
company             0
body-style          0
wheel-base          0
length              0
engine-type         0
num-of-cylinders    0
horsepower          0
average-mileage     0
price               5
dtype: int64

In [198]:
#let's fill the NAN values in price clumn with 0
cars=cars.dropna()

In [199]:
cars['price']=pd.to_numeric(cars['price'],errors='coerce') #converting non numerical values to numerical

C:\Users\Sam\AppData\Local\Temp\ipykernel_6568\2880784667.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cars['price']=pd.to_numeric(cars['price'],errors='coerce') #converting non numerical values to numerical

In [200]:
#now checking again
cars.head(10)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
5,5,audi,sedan,99.8,177.3,ohc,five,110,19,15250.0
6,6,audi,wagon,105.8,192.7,ohc,five,110,19,18920.0
7,9,bmw,sedan,101.2,176.8,ohc,four,101,23,16430.0
8,10,bmw,sedan,101.2,176.8,ohc,four,101,23,16925.0
10,13,bmw,sedan,103.5,189.0,ohc,six,182,16,30760.0
11,14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0

# Printing most expensive car’s company name and price.

In [202]:
group=cars.groupby('company').max()

In [176]:
max_price=group['price'].max()
company=group['price'].idxmax()
print(f'The most expensive car is  {company} with price {max_price}:' )

The most expensive car is  mercedes-benz with price 45400.0:

# Count total cars per company

In [203]:
total_cars=cars['company'].value_counts()
print('Total Cars per company')
total_cars

Total Cars per company

toyota           7
bmw              5
mazda            5
nissan           5
mercedes-benz    4
mitsubishi       4
volkswagen       4
alfa-romero      3
audi             3
jaguar           3
chevrolet        2
dodge            2
honda            2
porsche          2
volvo            2
isuzu            1
Name: company, dtype: int64

# Find each company’s Highest price car

In [204]:
each_max=group['price']
each_max

company
alfa-romero      16500.0
audi             18920.0
bmw              41315.0
chevrolet         6295.0
dodge             6377.0
honda            12945.0
isuzu             6785.0
jaguar           36000.0
mazda            18344.0
mercedes-benz    45400.0
mitsubishi        8189.0
nissan           13499.0
porsche          37028.0
toyota           15750.0
volkswagen        9995.0
volvo            13415.0
Name: price, dtype: float64

# Find the average mileage of each car making company

In [194]:
group=cars.groupby('company').mean()
avg_mileage=group['average-mileage']
avg_mileage

C:\Users\Sam\AppData\Local\Temp\ipykernel_6568\1436348944.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  group=cars.groupby('company').mean()

company
alfa-romero      20.333333
audi             20.000000
bmw              19.000000
chevrolet        42.500000
dodge            31.000000
honda            27.000000
isuzu            24.000000
jaguar           14.333333
mazda            28.000000
mercedes-benz    18.000000
mitsubishi       29.500000
nissan           31.400000
porsche          17.000000
toyota           28.714286
volkswagen       31.750000
volvo            23.000000
Name: average-mileage, dtype: float64